app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-04-08 14:28:51.045633"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(params.require(:article).permit(:title, :description))